# 행 삭제

In [1]:
import pandas as pd

In [5]:
friends = [
    {'age': 15, 'job': 'student'},
    {'age': 25, 'job': 'developer'},
    {'age': 30, 'job': 'teacher'}
]
df = pd.DataFrame(friends,
                 index=['John', 'Jenny', 'Nate'],
                 columns=['age', 'job'])

In [6]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

## drop

In [7]:
# index로 제거
df.drop(['John', 'Nate'])

       age        job
Jenny   25  developer

In [8]:
df	# 삭제된 정보 df에 반영 안 됨

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [9]:
df = df.drop(['John', 'Nate'])	# 삭제된 정보 df에 반영하고 싶은 경우 결과를 넣어줌

In [10]:
df

       age        job
Jenny   25  developer

### drop inplace option
- False : 복사본을 반환. 기본값
- True : 제자리에서 작업을 수행하고 None을 반환

In [ ]:
help(df.drop)

In [11]:
df = pd.DataFrame(friends,
                 index=['John', 'Jenny', 'Nate'],
                 columns=['age', 'job'])

In [12]:
df

       age        job
John    15    student
Jenny   25  developer
Nate    30    teacher

In [13]:
df.drop(['John', 'Nate'], inplace=True)

In [14]:
df

       age        job
Jenny   25  developer

### drop by index

In [36]:
friends = [
    {'name': 'John', 'age': 15, 'job': 'student'},
    {'name': 'Jenny', 'age': 25, 'job': 'developer'},
    {'name': 'Nate', 'age': 30, 'job': 'teacher'}
]
df = pd.DataFrame(friends,
                 columns=['name','age', 'job'])

In [37]:
df

    name  age        job
0   John   15    student
1  Jenny   25  developer
2   Nate   30    teacher

In [38]:
df = df.drop(df.index[[0, 2]])

In [39]:
df

    name  age        job
1  Jenny   25  developer

### drop by condition

In [40]:
df = pd.DataFrame(friends,
                 columns=['name','age', 'job'])

In [41]:
df = df[df.age > 20]

In [42]:
df

    name  age        job
1  Jenny   25  developer
2   Nate   30    teacher

# 열 삭제

In [47]:
df = pd.DataFrame(friends,
                 columns=['name','age', 'job'])

In [48]:
df

    name  age        job
0   John   15    student
1  Jenny   25  developer
2   Nate   30    teacher

In [49]:
# column에서 'age' 제거
df = df.drop('age', axis=1)

In [50]:
df

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher

### drop inplace option

In [51]:
df = pd.DataFrame(friends,
                 columns=['name','age', 'job'])

In [52]:
df

    name  age        job
0   John   15    student
1  Jenny   25  developer
2   Nate   30    teacher

In [53]:
df.drop('age', axis=1, inplace=True)

In [54]:
df

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher